DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp1/fw/config_all.c
/*
 * Arm SCP/MCP Software
 * Copyright (c) 2022-2023, Linaro Limited and Contributors. All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <fwk_assert.h>
#include <fwk_element.h>
#include <fwk_id.h>
#include <fwk_mm.h>
#include <fwk_module.h>
#include <fwk_module_idx.h>

#include <mod_clock.h>
#ifdef CFG_SCPFW_MOD_DVFS
#include <mod_dvfs.h>
#endif
#include <mod_msg_smt.h>
#include <mod_optee_clock.h>
#include <mod_optee_mbx.h>
#include <mod_optee_reset.h>
#ifdef CFG_SCPFW_MOD_PSU
#include <mod_psu.h>
#include <mod_psu_optee_regulator.h>
#endif
#include <mod_reset_domain.h>
#include <mod_scmi.h>
#include <mod_scmi_clock.h>
#include <mod_scmi_perf.h>
#include <mod_scmi_reset_domain.h>
#include <mod_scmi_voltage_domain.h>
#include <mod_stm32_regu_consumer.h>
#include <mod_voltage_domain.h>
#include <scmi_agents.h>

#include <assert.h>
#include <stddef.h>
#include <stdint.h>

#include <drivers/regulator.h>
#include <drivers/stm32mp_dt_bindings.h>
#include <kernel/panic.h>
#include <scmi_agent_configuration.h>
#include <stm32_util.h>
#include <util.h>

/* SCMI agent and services (channels) */
static struct mod_scmi_agent *scmi_agent_table;
static struct mod_scmi_config scmi_data;
static struct fwk_element *scmi_service_elt;

/* SCMI channel mailbox/shmem */
static struct fwk_element *msg_smt_elt;
static struct mod_msg_smt_channel_config *msg_smt_data;
static struct fwk_element *optee_mbx_elt;
static struct mod_optee_mbx_channel_config *optee_mbx_data;

#ifdef CFG_SCPFW_MOD_SCMI_CLOCK
/* SCMI clock generic */
static struct mod_scmi_clock_agent *scmi_clk_agent_tbl;
#endif

#ifdef CFG_SCPFW_MOD_CLOCK
/* Clocks and optee/clock, same number/indices. Elements and configuration data */
static struct fwk_element *optee_clock_elt;		/* Optee/clock elements */
static struct mod_optee_clock_config *optee_clock_cfg;	/* Config data for optee/clock elements */
static struct fwk_element *clock_elt;			/* Clock elements */
static struct mod_clock_dev_config *clock_data;		/* Config data for clock elements */
#endif

#ifdef CFG_SCPFW_MOD_DVFS
/* 1 DVFS (elt & data) per DVFS exposed */
static struct mod_dvfs_domain_config *dvfs_data;
static struct fwk_element *dvfs_elt;
/* A unique scmi_perf instance refers to perf domains data (DVFS instance) */
static struct mod_scmi_perf_domain_config *scmi_perf_domain_data;
struct fwk_module_config config_scmi_perf;

/* PSU and optee/psu-regu, used with DVFS. Elements and configuration data */
static struct fwk_element *psu_optee_regu_elt;
static struct mod_psu_optee_regulator_dev_config *psu_optee_regu_data;
static struct fwk_element *psu_elt;
static struct mod_psu_element_cfg *psu_data;
#endif

#ifdef CFG_SCPFW_MOD_RESET_DOMAIN
/* SCMI reset domains and optee reset controller */
static struct mod_scmi_reset_domain_agent *scmi_reset_agent_tbl;
static struct fwk_element *optee_reset_elt;
static struct mod_optee_reset_dev_config *optee_reset_data;
static struct fwk_element *reset_elt;
static struct mod_reset_domain_dev_config *reset_data;
#endif

#ifdef CFG_SCPFW_MOD_VOLTAGE_DOMAIN
/* SCMI voltage domains and optee regulators */
static struct mod_scmi_voltd_agent *scmi_voltd_agent_tbl;
static struct fwk_element *optee_regu_elt;
static struct mod_stm32_regu_consumer_dev_config *optee_regu_data;
static struct fwk_element *voltd_elt;
static struct mod_voltd_dev_config *voltd_data;
#endif

/* Config data for scmi module */
static const struct fwk_element *get_scmi_service_table(fwk_id_t module_id)
{
    return scmi_service_elt; /* scmi_service_elt filled during initialization */
}

struct fwk_module_config config_scmi = {
    .data = (void *)&scmi_data, /* scmi_data filled during initialization */
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(get_scmi_service_table),
};

/* Config data for optee_mbx module */
static const struct fwk_element *optee_mbx_get_element_table(fwk_id_t module_id)
{
    return (const struct fwk_element *)optee_mbx_elt;
}

struct fwk_module_config config_optee_mbx = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(optee_mbx_get_element_table),
};

/* Config data for msg_smt module */
static const struct fwk_element *msg_smt_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_MSG_SMT);
    return (const struct fwk_element *)msg_smt_elt;
}

struct fwk_module_config config_msg_smt = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(msg_smt_get_element_table),
};

/* Config data for scmi_clock, clock and optee_clock modules */
#ifdef CFG_SCPFW_MOD_SCMI_CLOCK
struct fwk_module_config config_scmi_clock = {
    .data = &((struct mod_scmi_clock_config){
        .agent_table = NULL,			/* Allocated during initialization */
        .agent_count = 0,			/* Set during initialization */
    }),
};
#endif

#ifdef CFG_SCPFW_MOD_CLOCK
static const struct fwk_element *clock_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_CLOCK);
    return (const struct fwk_element *)clock_elt;
}

struct fwk_module_config config_clock = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(clock_get_element_table),
};

static const struct fwk_element *optee_clock_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_OPTEE_CLOCK);
    return (const struct fwk_element *)optee_clock_elt;
}

struct fwk_module_config config_optee_clock = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(optee_clock_get_element_table),
};
#endif

/* Config data for scmi_reset_domain, reset_domain and optee_reset modules */
#ifdef CFG_SCPFW_MOD_RESET_DOMAIN
struct fwk_module_config config_scmi_reset_domain = {
    .data = &((struct mod_scmi_reset_domain_config){
        .agent_table = NULL,			/* Allocated during initialization */
        .agent_count = 0,			/* Set during initialization */
    }),
};

static const struct fwk_element *reset_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_RESET_DOMAIN);
    return (const struct fwk_element *)reset_elt;
}

struct fwk_module_config config_reset_domain = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(reset_get_element_table),
};

