DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp1/fw/config_all.c
static const struct fwk_element *optee_reset_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_OPTEE_RESET);
    return (const struct fwk_element *)optee_reset_elt;
}

struct fwk_module_config config_optee_reset = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(optee_reset_get_element_table),
};
#endif

#ifdef CFG_SCPFW_MOD_VOLTAGE_DOMAIN
/* Config data for scmi_voltage_domain, voltage_domain and optee_regu modules */
struct fwk_module_config config_scmi_voltage_domain = {
    .data = &((struct mod_scmi_voltd_config){
        .agent_table = NULL,			/* Allocated during initialization */
        .agent_count = 0,			/* Set during initialization */
    }),
};

static const struct fwk_element *voltd_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_VOLTAGE_DOMAIN);
    return (const struct fwk_element *)voltd_elt;
}

struct fwk_module_config config_voltage_domain = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(voltd_get_element_table),
};

static const struct fwk_element *stm32_regu_consumer_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_STM32_REGU_CONSUMER);
    return (const struct fwk_element *)optee_regu_elt;
}

struct fwk_module_config config_stm32_regu_consumer = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(stm32_regu_consumer_get_element_table),
};
#endif

#ifdef CFG_SCPFW_MOD_DVFS
/* Config data for scmi_perf and dvfs  module */
struct fwk_module_config config_scmi_perf = {
    .data = &((struct mod_scmi_perf_config){
        .domains = NULL,			/* Allocated during initialization */
        .perf_doms_count = 0,			/* Set during initialization */
        .fast_channels_alarm_id = FWK_ID_NONE_INIT,
#ifdef BUILD_HAS_MOD_STATISTICS
        .stats_enabled = true,
#endif
    }),
};

static const struct fwk_element *dvfs_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_DVFS);
    return (const struct fwk_element *)dvfs_elt;
}

struct fwk_module_config config_dvfs = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(dvfs_get_element_table),
};

/* Config data for psu and optee/psu module */
static const struct fwk_element *psu_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_PSU);
    return (const struct fwk_element *)psu_elt;
}

struct fwk_module_config config_psu = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(psu_get_element_table),
};

static const struct fwk_element *psu_optee_regu_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_PSU_OPTEE_REGULATOR);
    return (const struct fwk_element *)psu_optee_regu_elt ;
}

struct fwk_module_config config_psu_optee_regulator = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(psu_optee_regu_get_element_table),
};
#endif

/*
 * Indices state when applying agents configuration
 * @channel_count: Number of channels (mailbox/shmem links) used
 * @clock_index: Current index for clock and optee/clock (same indices)
 * @clock_count: Number of clocks (also number of optee/clocks)
 * @reset_index: Current index for reset controller and optee/reset
 * @reset_count: Number of reset controller (optee/reset) instances
 * @regu_index: Current index for voltd and optee/regulator
 * @regu_count: Number of voltd (optee/regulator) instances
 * @psu_index: Current index for PSU and optee/PSU instances
 * @psu_count: Number of PSU (optee/PSU) instances
 * @dvfs_index: Current index for DVFS instance
 * @dvfs_count: Number of DVFS instances
 */
struct scpfw_resource_counter {
    size_t channel_count;
    size_t clock_index;
    size_t clock_count;
    size_t reset_index;
    size_t reset_count;
    size_t regu_index;
    size_t regu_count;
    size_t psu_index;
    size_t psu_count;
    size_t dvfs_index;
    size_t dvfs_count;
} scpfw_resource_counter;

/*
 * Count once for all the several instances and allocate global resources.
 * Global resources are clock, optee/clock, reset, optee/reset, regu,
 * optee/regu, psu, optee/psu, dvfs, perfd, ...;
 */
static void count_resources(struct scpfw_config *cfg)
{
    size_t i, j;

    for (i = 0; i < cfg->agent_count; i++) {
        struct scpfw_agent_config *agent_cfg = cfg->agent_config + i;

        scpfw_resource_counter.channel_count += agent_cfg->channel_count;

        for (j = 0; j < agent_cfg->channel_count; j++) {
            struct scpfw_channel_config *channel_cfg = agent_cfg->channel_config + j;

            /* Clocks for scmi_clock and for DVFS */
            scpfw_resource_counter.clock_count += channel_cfg->clock_count;
            scpfw_resource_counter.clock_count += channel_cfg->perfd_count;
            /* Reset for smci_reset only */
            scpfw_resource_counter.reset_count += channel_cfg->reset_count;
            /* Regulators for smci_voltage_domain only */
            scpfw_resource_counter.regu_count += channel_cfg->voltd_count;
            /* DVFS and PSU DVFS only */
            scpfw_resource_counter.dvfs_count += channel_cfg->perfd_count;
            scpfw_resource_counter.psu_count += channel_cfg->perfd_count;
        }
    }

#ifndef CFG_SCPFW_MOD_CLOCK
    fwk_assert(!scpfw_resource_counter.clock_count);
#endif
#ifndef CFG_SCPFW_MOD_RESET_DOMAIN
    fwk_assert(!scpfw_resource_counter.reset_count);
#endif
#ifndef CFG_SCPFW_MOD_VOLTAGE_DOMAIN
    fwk_assert(!scpfw_resource_counter.regu_count);
#endif
#ifndef CFG_SCPFW_MOD_DVFS
    fwk_assert(!scpfw_resource_counter.dvfs_count);
#endif
#ifndef CFG_SCPFW_MOD_PSU
    fwk_assert(!scpfw_resource_counter.psu_count);
#endif
}

/*
 * Allocate all tables that may be needed. An optimized implementation would
 * allocate a single piece of memory and set the pointers accordingly.
 * */
static void allocate_global_resources(struct scpfw_config *cfg)
{
    struct mod_scmi_reset_domain_config *scmi_reset_config __maybe_unused;
    struct mod_scmi_voltd_config *scmi_voltd_config __maybe_unused;
    struct mod_scmi_clock_config *scmi_clock_config __maybe_unused;
    /* @cfg does not consider agent #0 this the reserved platform/server agent */
    size_t __maybe_unused scmi_agent_count = cfg->agent_count + 1;

#ifdef CFG_SCPFW_MOD_SCMI_CLOCK
    /* SCMI clock domains resources */
    scmi_clk_agent_tbl = fwk_mm_calloc(scmi_agent_count,
                                       sizeof(*scmi_clk_agent_tbl));
    scmi_clock_config = (void *)config_scmi_clock.data;
    scmi_clock_config->agent_table = scmi_clk_agent_tbl;
    scmi_clock_config->agent_count = scmi_agent_count;
#endif

#ifdef CFG_SCPFW_MOD_CLOCK
    /* Clock domains resources */
    optee_clock_cfg = fwk_mm_calloc(scpfw_resource_counter.clock_count,
                                    sizeof(*optee_clock_cfg));
    optee_clock_elt = fwk_mm_calloc(scpfw_resource_counter.clock_count + 1,
                                    sizeof(*optee_clock_elt));

    clock_data = fwk_mm_calloc(scpfw_resource_counter.clock_count,
                               sizeof(*clock_data));
    clock_elt = fwk_mm_calloc(scpfw_resource_counter.clock_count + 1,
                              sizeof(*clock_elt));
#endif

#ifdef CFG_SCPFW_MOD_RESET_DOMAIN
    /* SCMI reset domains resources */
    scmi_reset_agent_tbl = fwk_mm_calloc(scmi_agent_count,
                                         sizeof(*scmi_reset_agent_tbl));
    scmi_reset_config = (void *)config_scmi_reset_domain.data;
    scmi_reset_config->agent_table = scmi_reset_agent_tbl;
    scmi_reset_config->agent_count = scmi_agent_count;

