DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp1/fw/config_all.c
    optee_reset_data = fwk_mm_calloc(scpfw_resource_counter.reset_count,
                                     sizeof(*optee_reset_data));
    optee_reset_elt = fwk_mm_calloc(scpfw_resource_counter.reset_count + 1,
                                    sizeof(*optee_reset_elt));

    reset_data = fwk_mm_calloc(scpfw_resource_counter.reset_count,
                               sizeof(*reset_data));
    reset_elt = fwk_mm_calloc(scpfw_resource_counter.reset_count + 1,
                              sizeof(*reset_elt));
#endif

#ifdef CFG_SCPFW_MOD_DVFS
    /* PSU and related optee PSU regulator resources */
    psu_optee_regu_elt = fwk_mm_calloc(scpfw_resource_counter.dvfs_count + 1,
                                  sizeof(*psu_optee_regu_elt));
    psu_optee_regu_data = fwk_mm_calloc(scpfw_resource_counter.dvfs_count,
                                  sizeof(*psu_optee_regu_data));

    psu_elt = fwk_mm_calloc(scpfw_resource_counter.psu_count + 1,
                            sizeof(*psu_elt));
    psu_data = fwk_mm_calloc(scpfw_resource_counter.psu_count,
                             sizeof(*psu_data));

    /* DVFS and SCMI performance management resources */
    dvfs_elt = fwk_mm_calloc(scpfw_resource_counter.dvfs_count + 1,
                             sizeof(*dvfs_elt));
    dvfs_data = fwk_mm_calloc(scpfw_resource_counter.dvfs_count,
                              sizeof(*dvfs_data));

    scmi_perf_domain_data = fwk_mm_calloc(scpfw_resource_counter.dvfs_count,
                                          sizeof(*scmi_perf_domain_data));
#endif

#ifdef CFG_SCPFW_MOD_VOLTAGE_DOMAIN
    /* SCMI voltage domains resources */
    scmi_voltd_agent_tbl = fwk_mm_calloc(scmi_agent_count,
                                         sizeof(*scmi_voltd_agent_tbl));
    scmi_voltd_config = (void *)config_scmi_voltage_domain.data;
    scmi_voltd_config->agent_table = scmi_voltd_agent_tbl;
    scmi_voltd_config->agent_count = scmi_agent_count;

    optee_regu_data = fwk_mm_calloc(scpfw_resource_counter.regu_count,
                                    sizeof(*optee_regu_data));
    optee_regu_elt = fwk_mm_calloc(scpfw_resource_counter.regu_count + 1,
                                    sizeof(*optee_regu_elt));

    voltd_data = fwk_mm_calloc(scpfw_resource_counter.regu_count,
                               sizeof(*voltd_data));
    voltd_elt = fwk_mm_calloc(scpfw_resource_counter.regu_count + 1,
                              sizeof(*voltd_elt));
#endif
}

static void set_scmi_comm_resources(struct scpfw_config *cfg)
{
    unsigned int channel_index;
    size_t i, j;
    /* @cfg does not consider agent #0 this the reserved platform/server agent */
    size_t scmi_agent_count = cfg->agent_count + 1;

    scmi_agent_table = fwk_mm_calloc(scmi_agent_count,
                                     sizeof(*scmi_agent_table));

    scmi_service_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                     sizeof(*scmi_service_elt));

    msg_smt_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                sizeof(*msg_smt_elt));
    msg_smt_data = fwk_mm_calloc(scpfw_resource_counter.channel_count,
                                 sizeof(*msg_smt_data));

    optee_mbx_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                  sizeof(*optee_mbx_elt));
    optee_mbx_data = fwk_mm_calloc(scpfw_resource_counter.channel_count,
                                   sizeof(*optee_mbx_data));

    /* Set now the uniqnue scmi module instance configuration data */
    scmi_data = (struct mod_scmi_config){
        .agent_table = scmi_agent_table,
        .agent_count = scmi_agent_count,
        .protocol_count_max = 9,
        .vendor_identifier = "ST",
        .sub_vendor_identifier = "ST",
    };

    channel_index = 0;

    for (i = 0; i < cfg->agent_count; i++) {
        struct scpfw_agent_config *agent_cfg = cfg->agent_config + i;
        size_t agent_index = i + 1;

        scmi_agent_table[agent_index].type = SCMI_AGENT_TYPE_OSPM;
        scmi_agent_table[agent_index].name = agent_cfg->name;

        for (j = 0; j < agent_cfg->channel_count; j++) {
            struct scpfw_channel_config *channel_cfg = agent_cfg->channel_config + j;
            struct mod_scmi_service_config *service_data;

            service_data = fwk_mm_calloc(1, sizeof(*service_data));
            *service_data = (struct mod_scmi_service_config){
                .transport_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_MSG_SMT, 0),
                .transport_api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_MSG_SMT,
                                                              MOD_MSG_SMT_API_IDX_SCMI_TRANSPORT),
                .scmi_agent_id = agent_cfg->agent_id,
                .scmi_p2a_id = FWK_ID_NONE_INIT,
            };

            /* Currently expect 1 agent with ID SCMI_AGENT_ID_NSEC0 (1) */
            fwk_assert(service_data->scmi_agent_id == SCMI_AGENT_ID_NSEC0);

            scmi_service_elt[channel_index].name = channel_cfg->name;
            scmi_service_elt[channel_index].data = service_data;

            msg_smt_elt[channel_index].name = channel_cfg->name;
            msg_smt_elt[channel_index].data = (void *)(msg_smt_data + channel_index);

            msg_smt_data[channel_index] = (struct mod_msg_smt_channel_config){
                .type = MOD_MSG_SMT_CHANNEL_TYPE_REQUESTER,
                .mailbox_size = 128,
                .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_MBX,
                                                           channel_index),
                .driver_api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_MBX, 0),
            };

            optee_mbx_elt[channel_index].name = channel_cfg->name;
            optee_mbx_elt[channel_index].data = (void *)(optee_mbx_data + channel_index);

            optee_mbx_data[channel_index] = (struct mod_optee_mbx_channel_config){
                .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_MSG_SMT, channel_index),
                .driver_api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_MSG_SMT,
                                                           MOD_MSG_SMT_API_IDX_DRIVER_INPUT),
            };

            channel_index++;
        }
    }
};

