DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp1/fw/config_all.c
                    optee_regu_elt[regu_index].name = name;
                    optee_regu_elt[regu_index].data = (void *)(optee_regu_data + regu_index);
                    optee_regu_data[regu_index].rdev = voltd_cfg->rdev;
                    optee_regu_data[regu_index].default_enabled = voltd_cfg->enabled;

                    voltd_data[regu_index].driver_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_STM32_REGU_CONSUMER,
                                                      regu_index);
                    voltd_data[regu_index].api_id =
                        (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_STM32_REGU_CONSUMER, 0);

                    voltd_elt[regu_index].name = name;
                    voltd_elt[regu_index].data = (void *)(voltd_data + regu_index);
                    regu_index++;
                }

                scpfw_resource_counter.regu_index = regu_index;
            }
#endif

#ifdef CFG_SCPFW_MOD_DVFS
            if (channel_cfg->perfd_count) {
                size_t clock_index = scpfw_resource_counter.clock_index;
                size_t psu_index = scpfw_resource_counter.psu_index;
                size_t dvfs_index = scpfw_resource_counter.dvfs_index;

                for (k = 0; k < channel_cfg->perfd_count; k++) {
                    struct mod_scmi_perf_config *scmi_perf_data = NULL;
                    struct scmi_perfd *perfd_cfg = channel_cfg->perfd + k;

                    /*
                     * DVFS with SCMI performance management domains
                     * 1 initial scmi_perf instance defines the number of DVFS's
                     * For each DVFS instance:
                     * - 1 instance (elt/config) of dvfs, psu, optee/psu, clock, optee/clock
                     * Clocks and optee/clocks are already allocated but not yet set.
                     */

                    /* scmi_perf: data defines the DVFS domains indices */
                    scmi_perf_domain_data[dvfs_index] = (struct mod_scmi_perf_domain_config){ };

                    scmi_perf_data = (void *)config_scmi_perf.data;

                    scmi_perf_data[dvfs_index].domains = (void *)scmi_perf_domain_data;
                    scmi_perf_data[dvfs_index].perf_doms_count = scpfw_resource_counter.dvfs_count;
                    scmi_perf_data[dvfs_index].fast_channels_alarm_id = (fwk_id_t)FWK_ID_NONE_INIT;
#ifdef BUILD_HAS_MOD_STATISTICS
                    scmi_perf_data[dvfs_index].stats_enabled = true;
#endif

                    /* dvfs instances: 1 instance per expose DVFS service */
                    dvfs_data[dvfs_index].psu_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_PSU, psu_index);
                    dvfs_data[dvfs_index].clock_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_CLOCK, clock_index);
                    dvfs_data[dvfs_index].latency = 0; /* not set, used for async access */
                    dvfs_data[dvfs_index].sustained_idx = perfd_cfg->initial_opp;
                    dvfs_data[dvfs_index].opps =
                        fwk_mm_calloc(perfd_cfg->dvfs_opp_count,
                                      sizeof(struct mod_dvfs_opp));

                    for (l = 0; l < perfd_cfg->dvfs_opp_count; l++) {
                        uint64_t power = 0;

                        /* Quick estimation of power consumpsion */
                        power = perfd_cfg->dvfs_opp_khz[l];
                        power *= perfd_cfg->dvfs_opp_mv[l];
                        power *= perfd_cfg->dvfs_opp_mv[l];
                        power /= 100 * 1000 * 1000;

                        dvfs_data[dvfs_index].opps[l] = (struct mod_dvfs_opp){
                            .level = perfd_cfg->dvfs_opp_khz[l] * 1000UL,
                            .frequency = perfd_cfg->dvfs_opp_khz[l],
                            .voltage = perfd_cfg->dvfs_opp_mv[l],
                            .power = (uint32_t)power,
                        };
                    }

                    dvfs_elt[dvfs_index].name = perfd_cfg->name;
                    dvfs_elt[dvfs_index].data = (void *)(dvfs_data + dvfs_index);

                    /* Module psu_optee module (elements and  configuration data) */
                    psu_optee_regu_elt[psu_index].name = perfd_cfg->rdev->reg_name;
                    psu_optee_regu_elt[psu_index].sub_element_count = scpfw_resource_counter.psu_count;
                    psu_optee_regu_elt[psu_index].data = (void *)(psu_optee_regu_data + psu_index);

                    psu_optee_regu_data[psu_index].rdev = perfd_cfg->rdev;

                    /* Module psu (elements and  configuration data) */
                    psu_elt[psu_index].name = perfd_cfg->rdev->reg_name;
                    psu_elt[psu_index].data = (void *)(psu_data + psu_index);
                    psu_data[psu_index].driver_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_PSU_OPTEE_REGULATOR, psu_index);
                    psu_data[psu_index].driver_api_id =
                        (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_PSU_OPTEE_REGULATOR, 0);

                    /* Module clock and optee_clock */
                    fwk_assert(!clock_elt[clock_index].data);

                    clock_elt[clock_index].name = perfd_cfg->clk->name;
                    clock_elt[clock_index].data = (void *)(clock_data + clock_index);

                    clock_data[clock_index] = (struct mod_clock_dev_config){
                        .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                                   clock_index),
                        .api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                            0),
                        .pd_source_id = FWK_ID_NONE,
                    };

                    optee_clock_cfg[clock_index].clk = perfd_cfg->clk;
                    optee_clock_cfg[clock_index].default_enabled = false;

                    optee_clock_elt[clock_index].name = perfd_cfg->clk->name;
                    optee_clock_elt[clock_index].data = (void *)(optee_clock_cfg + clock_index);

                    clock_index++;
                    psu_index++;
                    dvfs_index++;
                }

                scpfw_resource_counter.clock_index = clock_index;
                scpfw_resource_counter.psu_index = psu_index;
                scpfw_resource_counter.dvfs_index = dvfs_index;
            }
#endif
        }
    }
}

void scpfw_configure(struct scpfw_config *cfg)
{
    count_resources(cfg);
    allocate_global_resources(cfg);
    set_scmi_comm_resources(cfg);
    set_resources(cfg);
}
